import math
# کتابخانه ریاضی را فراخوانی میکنیم.

def random_float(n, a, b, xn="h"):
# یک تابع رندوم برای اعداد اعشاری میسازیم که چند ورودی نیاز دارد. تعداد اعداد مورد نیاز، ابتدای بازه،انتهای بازه و مقدار ثابت اولیه که برای مقدار ثابت اولیه یک حالت پیش فرض هم در نظر میگیریم
    xn = hash(xn)
#مقدار ثابت اولیه را با استفاده از تابع hash به صورت رندوم انتخاب میکنیم
    d = 1103515245
    c = 12345
    m = 2**31
#به یکسری متنغیر یکسری اعداد تست شده را نسبت میدهیم
    _list = []
    while len(_list) != n:
#یک حلقه تعریف میکنیم که تا زمانی که تعداد آرایه های لیست برابر تعداد رندمی که نیاز داریم نشده، همچنان ادامه دهد.
        xn = (d * xn + c) % m
# فرمول دنباله تصادفی اعداد
        xm = xn / m
#برای اینکمه عدد اعشاری شود
        xl = xm * (b - a) + a
# برای اینکه در دامنه باشد عدد
        _list.append(xl)
#مقدار به دست آمده را در لیست مورد نظر میریزیم
    return _list




# کتابخانه ریاضی را فراخوانی میکنیم.
def random_int(n, a, b, xn="h"):
# یک تابع رندوم برای اعداد اعشاری میسازیم که چند ورودی نیاز دارد. تعداد اعداد مورد نیاز، ابتدای بازه،انتهای بازه و مقدار ثابت اولیه که برای مقدار ثابت اولیه یک حالت پیش فرض هم در نظر میگیریم
    xn = hash(xn)
#مقدار ثابت اولیه را با استفاده از تابع hash به صورت رندوم انتخاب میکنیم
    d = 1103515245
    c = 12345
    m = 2**31
#به یکسری متنغیر یکسری اعداد تست شده را نسبت میدهیم
    _list = []
    while len(_list) != n:
#یک حلقه تعریف میکنیم که تا زمانی که تعداد آرایه های لیست برابر تعداد رندمی که نیاز داریم نشده، همچنان ادامه دهد.
        xn = (d * xn + c) % m
# فرمول دنباله تصادفی اعداد
        xm = xn / m
#برای اینکمه عدد اعشاری شود
        xl = xm * (b - a) + a
# برای اینکه در دامنه باشد عدد
        _list.append(int(xl))
#عدد صحیح مقدار به دست آمده را در لیست مورد نظر میریزیم
    return _list




def box(n, s=1.0, mu=0.0):
#یک تابع میسازیم و سه متغیر برایش تعریف میکنیم. یکی تعداد، یکی انحراف معیار و دیگری میانگین و برای دو مورد دوم هم یک مقدار پیش فرض در نظر میگیریم که برای توزیع یکنواخت است.
    u1 = (random_float(n, 0, 1, xn="p"))
    u2 = (random_float(n, 0, 1, xn="q"))
#دو نمونه اعدادتصادفی نیاز داریم که با فراخوانی تابع رندومم اعشاری که داریم با دادن دو مقدار متغیر ثابت مختلف میسازیم
    z = []
    # s = 1
    # mu = 0
    i = 0
    while i < len(u1):
#یک حلقه تعریف میکنیم که تا زمانی که آرایه لیست ها کامل پیماییده شود ادامه دارد
        x = math.sqrt(-2 * math.log(u1[i])) * math.cos(2 * math.pi * u2[i])
#فرمول باکس مولر
        x = s * x + mu
#
        z.append(x)
# مقادیر X را در لیست خالی Z میریزیم
        i += 1
    return z
